{"artist":{"name":"Alvino Rey","mbid":"6dc489d6-32fe-469f-b365-26a268f2fdbb","url":"https://www.last.fm/music/Alvino+Rey","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/04ce44b1bdd748c68b029cbffbae15af.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/04ce44b1bdd748c68b029cbffbae15af.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/04ce44b1bdd748c68b029cbffbae15af.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/04ce44b1bdd748c68b029cbffbae15af.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/04ce44b1bdd748c68b029cbffbae15af.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/04ce44b1bdd748c68b029cbffbae15af.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"11194","playcount":"41687"},"similar":{"artist":[{"name":"Lou Busch","url":"https://www.last.fm/music/Lou+Busch","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4fbad7ed0da74a37946b00862b2debe2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4fbad7ed0da74a37946b00862b2debe2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4fbad7ed0da74a37946b00862b2debe2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4fbad7ed0da74a37946b00862b2debe2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4fbad7ed0da74a37946b00862b2debe2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4fbad7ed0da74a37946b00862b2debe2.png","size":""}]},{"name":"Sam Butera","url":"https://www.last.fm/music/Sam+Butera","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ee363fc4d89c465cbf50c71b0423ebb9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ee363fc4d89c465cbf50c71b0423ebb9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ee363fc4d89c465cbf50c71b0423ebb9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee363fc4d89c465cbf50c71b0423ebb9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee363fc4d89c465cbf50c71b0423ebb9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee363fc4d89c465cbf50c71b0423ebb9.png","size":""}]},{"name":"Jonah Jones Quartet","url":"https://www.last.fm/music/Jonah+Jones+Quartet","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0508f5425e4941c28f52a4226119bd72.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0508f5425e4941c28f52a4226119bd72.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0508f5425e4941c28f52a4226119bd72.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0508f5425e4941c28f52a4226119bd72.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0508f5425e4941c28f52a4226119bd72.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0508f5425e4941c28f52a4226119bd72.png","size":""}]},{"name":"Henri Rene","url":"https://www.last.fm/music/Henri+Rene","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/348ff46635154110b4ea6e94f7b7e1ac.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/348ff46635154110b4ea6e94f7b7e1ac.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/348ff46635154110b4ea6e94f7b7e1ac.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/348ff46635154110b4ea6e94f7b7e1ac.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/348ff46635154110b4ea6e94f7b7e1ac.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/348ff46635154110b4ea6e94f7b7e1ac.png","size":""}]},{"name":"Spike Jones New Band","url":"https://www.last.fm/music/Spike+Jones+New+Band","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/217fd8359450469fafb09546f8e0d369.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/217fd8359450469fafb09546f8e0d369.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/217fd8359450469fafb09546f8e0d369.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/217fd8359450469fafb09546f8e0d369.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/217fd8359450469fafb09546f8e0d369.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/217fd8359450469fafb09546f8e0d369.png","size":""}]}]},"tags":{"tag":[{"name":"swing","url":"https://www.last.fm/tag/swing"},{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"space age pop","url":"https://www.last.fm/tag/space+age+pop"},{"name":"All","url":"https://www.last.fm/tag/All"},{"name":"Soundtrack","url":"https://www.last.fm/tag/Soundtrack"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Alvino+Rey/+wiki"}},"published":"29 May 2009, 08:55","summary":"Alvin McBurney (July 1, 1908 – February 2, 2004), known by his stage name Alvino Rey, was an American swing era musician and pioneer, often credited as the father of the pedal steel guitar. He was mainly associated with orchestral, big band and swing music, and towards the end of his career, jazz and exotica.\n\nAlvin McBurney was born in Oakland, California, in 1908, but moved with his family to Cleveland, Ohio. He showed very early signs of his mechanical and musical aptitude; he built his first radio at the age of eight and <a href=\"https://www.last.fm/music/Alvino+Rey\">Read more on Last.fm</a>","content":"Alvin McBurney (July 1, 1908 – February 2, 2004), known by his stage name Alvino Rey, was an American swing era musician and pioneer, often credited as the father of the pedal steel guitar. He was mainly associated with orchestral, big band and swing music, and towards the end of his career, jazz and exotica.\n\nAlvin McBurney was born in Oakland, California, in 1908, but moved with his family to Cleveland, Ohio. He showed very early signs of his mechanical and musical aptitude; he built his first radio at the age of eight and, within a couple of years, became one of the youngest licensed ham operators in the country. His interest in music grew when he received a banjo as a tenth birthday gift. He began studying guitar at the age of 12, listening to recordings by guitarists Eddie Lang and Roy Smeck. At 15 he invented an electrical amplifier for the guitar, but neglected to have it patented. He did patent several later versions. In 1927, Rey landed a job playing banjo with Cleveland bandleader Ev Jones. \"Yes, I joined the Union when I was 16,\" he said. He practiced amplifying acoustic instruments as a teenager, starting with this first banjo. \"I went to Lakewood High School and from there I went to New York and never did come back.\" he recalled. His career began in 1927, when he played banjo with Ev Jones. He signed with Phil Spitalny that same year, playing electric guitar in Spitalny's Orchestra. \"I spent two years in New York with Phil Spitalny and then went to California,\" Rey recalled. \"I joined Horace Heidt in San Francisco . . . he had a stage band, sort of like Fred Waring.\"  During this time he also studied guitar with vaudeville performer Roy Smeck.\n\nAlvino played in other bands, including alongside such names as Russ Morgan and Freddie Martin. While playing with Phil Spitalny's orchestra in New York, he changed his name to Alvino Rey in late 1929, to coincide with the Latin music craze in the city. From January 1932 to early 1939 Alvino played steel and Spanish guitar and in Horace Heidt's musical group, Horace Heidt And His Musical Knights. Here he pioneered the instrument, as well as becoming known for his unique sound, becaming one of the best-known (and best-paid) sidemen in the country, thanks to Heidt's weekly radio program. \"And there I met the King Sisters, and I married Luise, one of the sisters, in 1937,\" Rey has reminisced.[2] When in 1938 the Musical Knight's band landed a spot at the Baltimore Hotel[disambiguation needed] in New York, Heidt was bitter and irritated that the sponsor signed them up because they were impressed by Alyce King's vocals. He took the first opportunity to fire her - when she dropped her microphone and it hit an audience member. The other Sisters immediately resigned, followed by Alvino, and then saxophonist Frank DeVol.\n\nIn spring of 1935 Rey was hired by the Gibson Guitar Corporation to produce a prototype pickup with engineers at the Lyon & Healy company in Chicago, based on the one he developed for his own banjo. The result was used for Gibson's first electric guitar ES-150. The prototype is kept in the Experience Music Project museum in Seattle, commonly known as the Hendrix Museum.\nStarting in 1939, Rey used a carbon throat microphone to modulate his electric guitar sound. The mike, developed for military pilots, was worn by Rey's wife Luise, who stood behind a curtain and sang along with the guitar lines. The novel combination was called \"Singing Guitar\", and later became known as the Sonovox. Along with early Vocoders (initially called Voders), which were initially developed to scramble messages between the Pentagon and field commanders during WWII, the Sonovox innovation was one the first known talk box experiments. A Soundie film of Rey using the Sonovox is posted on YouTube and further info about Rey and the Sonovox can be found in the Dave Tomkin's book, \"How To Wreak A Nice Beach\" (How to Recognize Speech).\n\nRey formed his own group with the King Sisters (as lead singers) and Frank DeVol, heading for Los Angeles. The band was Mutual Broadcasting's houseband for three years, and through the band passed such musicians as Johnny Mandel, Paul Fredricks, Skeets Herfurt, Neal Hefti, Dave Tough, Mel Lewis, Don Lamond, Andy Russell, Alfred Burt and three of Woody Herman's future \"Four Brothers\" sax section: Al Cohn, Zoot Sims, and Herbie Steward. Notable arrangers in the band included Nelson Riddle, George Handy, Billy May, Ray Conniff, and DeVol. In 1941 the group filled in for Dinah Shore at New York's Paramount Theater, which led to greater exposure. [4] Soon afterward, they became one of the most popular acts in the country, while recording top ten hits and making appearances in Hollywood films. In 1942 Rey re-organized the orchestra, expanding the brass section. Although very popular, the ban by the Musicians' Union of 1943 put an end to their recordings.\n\nThe ban led to financial hardship for the band, who all took jobs at a local war-plant - the Lockheed aircraft factory in Burbank. Rey himself worked as a mechanic. During this time the group disbanded. In 1944 at age 36, Rey joined the United States Navy; he passed the Eddy Test and attended the Electronics Training Program, becoming a radar maintenance technician. In this period, he also led a service band, the Radio Chicago Orchestra. After his discharge in late 1945, he formed a new orchestra, which signed with Capitol Records and immediately produced a hit - a cover of Slim Gaillard's \"Cement Mixer\". Despite this, the band broke up around 1950, and Rey went on to lead smaller bands, sometimes with his brother-in-law, Buddy Cole. This continued through the 1950s, mostly in Southern California.\n\nIn the late 1950s, Rey served as musical director for the King Sisters. In 1965, ABC aired a special featuring the King family, which grew into a series (called The King Family Show) spanning five television seasons.[4] Rey was musical director for the show, simultaneously producing a series of record albums featuring the cast of the program. After the ABC show Rey worked on exotica projects with such artists as Esquivel, George Cates, and he also teamed with Jack Constanzo and other session aces in the Martin Denny-inspired group the Surfmen for Somerset Records. He played the theme to the film The Bat (1959 film) He also continued performing well into his eighties, leading a band that played Disneyland each year from the theme park's opening in 1955. Rey also made a series of comic instrumental LPs for Warner Bros. Records under the pseudonym Ira Ironstrings. His use of an alias was partly because of his ongoing contract with Capitol.\n\nIn the early 1990s, Rey moved with his wife Luise to Salt Lake City, Utah. There he formed a jazz quartet which played clubs locally with Luise sometimes sitting in. The couple finally retired in 1994 and his last public appearance was the same year, but he retained his interests in music and electronics into his mid-nineties. He started, but had to give up his own website selling Luise's memoir, \"Those Swinging Years\" and CDs.\n\nSome sources claim Rey became a Mormon about the time of his marriage to Luisa in 1937. However, it appears that he was not actually received into The Church of Jesus Christ of Latter-day Saints until 1969.\nRey's daughter, Liza Butler, is the mother of Win and William Butler, members of Canadian indie rock group Arcade Fire. Their debut album Funeral was heavily influenced by Rey's death, along with the deaths of relatives of other members of the band, during the recording period.[citation needed] The band released a live 1940 broadcast recording of Rey's song My Buddy, which appears as a B-side on their singles \"Neighborhood No. 1 (Tunnels)\" and \"Neighborhood No. 2 (Laika).\"\nIn 2004, after breaking his hip and suffering complications including pneumonia and congestive heart failure, Alvino Rey died at age 95, at a rehabilitation center in Utah.[2] He died seven years after his wife's death; they had been married fifty-seven years. He was still an amateur radio operator, holding the call W6UK.\n <a href=\"https://www.last.fm/music/Alvino+Rey\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}