{"artist":{"name":"Billy Price","mbid":"14b54440-a9f4-4bab-8438-004c92df945a","url":"https://www.last.fm/music/Billy+Price","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cc9c16ed3afa42959d1c53ddfdb4da18.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cc9c16ed3afa42959d1c53ddfdb4da18.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cc9c16ed3afa42959d1c53ddfdb4da18.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cc9c16ed3afa42959d1c53ddfdb4da18.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cc9c16ed3afa42959d1c53ddfdb4da18.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cc9c16ed3afa42959d1c53ddfdb4da18.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"400","playcount":"2742"},"similar":{"artist":[{"name":"Johnny Rawls","url":"https://www.last.fm/music/Johnny+Rawls","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b6daa92815e94ddda0bf77f5dd35406e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b6daa92815e94ddda0bf77f5dd35406e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b6daa92815e94ddda0bf77f5dd35406e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6daa92815e94ddda0bf77f5dd35406e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6daa92815e94ddda0bf77f5dd35406e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6daa92815e94ddda0bf77f5dd35406e.png","size":""}]},{"name":"Dan Bubien","url":"https://www.last.fm/music/Dan+Bubien","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c4f2f7a5da3f4d7db86b93897893c62a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c4f2f7a5da3f4d7db86b93897893c62a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c4f2f7a5da3f4d7db86b93897893c62a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4f2f7a5da3f4d7db86b93897893c62a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4f2f7a5da3f4d7db86b93897893c62a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4f2f7a5da3f4d7db86b93897893c62a.png","size":""}]},{"name":"Sammy Eubanks","url":"https://www.last.fm/music/Sammy+Eubanks","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Walter \"Wolfman\" Washington","url":"https://www.last.fm/music/Walter+%22Wolfman%22+Washington","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3f038baadeb04605b7a9d85fcfbaecba.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3f038baadeb04605b7a9d85fcfbaecba.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3f038baadeb04605b7a9d85fcfbaecba.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f038baadeb04605b7a9d85fcfbaecba.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f038baadeb04605b7a9d85fcfbaecba.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f038baadeb04605b7a9d85fcfbaecba.png","size":""}]},{"name":"Hurricane Ruth","url":"https://www.last.fm/music/Hurricane+Ruth","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dd3d331cf5954b7da8108c951b5d1592.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dd3d331cf5954b7da8108c951b5d1592.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dd3d331cf5954b7da8108c951b5d1592.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dd3d331cf5954b7da8108c951b5d1592.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dd3d331cf5954b7da8108c951b5d1592.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dd3d331cf5954b7da8108c951b5d1592.png","size":""}]}]},"tags":{"tag":[{"name":"funk","url":"https://www.last.fm/tag/funk"},{"name":"male vocalist","url":"https://www.last.fm/tag/male+vocalist"},{"name":"soul","url":"https://www.last.fm/tag/soul"},{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"blues vocalist","url":"https://www.last.fm/tag/blues+vocalist"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Billy+Price/+wiki"}},"published":"23 Feb 2007, 20:00","summary":"Billy Price, east coast blue-eyed soul man, has been entertaining audiences for the past three decades. In his hometown of Pittsburgh, Pa., he is an institution. Price's popularity isn't hard to explain. As Geoffrey Himes of the Washington Post has written, \"Unlike so many blues revivalists, Price is not an imitation of older, better singers--he's the real thing.\" Grant Britt of the Independent aptly describes Billy Price “Price doesn't sound like any particular soul singer <a href=\"https://www.last.fm/music/Billy+Price\">Read more on Last.fm</a>","content":"Billy Price, east coast blue-eyed soul man, has been entertaining audiences for the past three decades. In his hometown of Pittsburgh, Pa., he is an institution. Price's popularity isn't hard to explain. As Geoffrey Himes of the Washington Post has written, \"Unlike so many blues revivalists, Price is not an imitation of older, better singers--he's the real thing.\" Grant Britt of the Independent aptly describes Billy Price “Price doesn't sound like any particular soul singer, but he possesses the vocal characteristics of the best--liquid smoke wrapped in barbed wire. He's backed by a tight, horn-heavy band that provides the punch of the old HI Records-Al Green sessions. And although Price insists he can't sing like Green, he's got that same intensity and a gospel scream as churchy as the Rev's.” The former lead vocalist with Roy Buchanan and with Billy Price & the Keystone Rhythm Band, and he now performs his soulful blues with the Billy Price Band in venues across the U.S. and Europe. Kathleen Minke and Bob Sekinger of Blues Reveu capture the feeling that his long time fans have. “Billy Price is a musical Clark Kent. Entering the club, it's easy for even the most rabid fan to overlook the bespectacled, mild-mannered man nursing a cup of convenience-store coffee. But when he takes the stage, he transforms into one of the most dynamic singers you'll ever hear, anywhere, anytime.”\n\nBilly Price's latest recording East End Avenue on Bonedog Records, features the Billy Price Band on 13 original new songs, including five songs co-written by Price and Jon Tiven. Tiven was the winner of four 2006 Blues Music Awards including song of the year and Soul-Blues Album of the Year that he produced for Little Milton. East End Avenue has earned critical acclaim making the “Best of 2006” lists at Bobtje Blues (#11), American Music (#91), and the Pittsburgh Post Gazette. The Billy Price and the Billy Price Band were nominated in three categories in the Blues Critic Awards 2006 for Contemporary Blues: Best Soul Blues Album, Best Male Blues Singer, Best Horn Section. The Blues Critic writes of “Together with a set of quality songs and a tight, funky band replete with horns and back-ups, this top-drawer release deserves to catapult him to a much wider audience.”\n\n\nBilly Price first attracted national attention during his three-year association with guitarist Roy Buchanan. Price is the vocalist on two of Buchanan's LPs, That's What I'm Here For and Livestock. With Buchanan, Price toured the U.S. and Canada, playing such venues as Carnegie Hall in New York, the Newport Jazz Festival, the Roxy and the Troubadour in Los Angeles, and the Spectrum in Philadelphia. Price assembled Billy Price and the Keystone Rhythm Band in 1977. Before their breakup in 1990, the band recorded four critically acclaimed LPs and developed a reputation as one of the most exciting touring bands in the U.S.\n\nPrice formed The Billy Price Band in 1990. In addition to performing popular songs from Price's years with Buchanan and the Keystone Rhythm Band, the Billy Price Band features new interpretations of blues, R & B, and soul classics. Members of the Billy Price Band are Lenny Smith (guitar), Paul Thompson (bass), Dave Dodd (drums), Jimmy Britton (keyboards), Joe Herndon (trumpet), Eric DeFade (tenor sax) and Rick Matt (baritone and tenor sax).\n\nBilly has released 11 recordings since 1977. His most notable recordings include the Soul Collection (1977) and Can I Change My Mind (1999) The 1977 Billy Price release The Soul Collection, which featured a duet by Price and his friend and mentor Otis Clay on Clay's \"That's How It Is,\" as well as background vocals by veteran Chicago vocalists Theresa Davis (former member of the Emotions), Robin Robinson, and Dianne Madison. In Living Blues (September-October 1997), Bill Dahl called The Soul Collection \"an inspired stroll through the glorious history of soul music [invested with] uncommon passion and authenticity.\" In the April 25, 1997 edition of the Washington Post, Mike Joyce called The Soul Collection \"an R & B homage full of revealing and compelling performances...Price is a terrifically expressive soul singer,\" says Joyce, \"one who conveys both the pain and the pleasure in these choice songs.\" Can I Change My Mind on Green Dolphin Records was produced in Los Angeles by Jerry \"Swamp Dogg\" Williams, who has also produced artists such as Z.Z. Hill, Doris Duke, Irma Thomas, Solomon Burke, Patti LaBelle, Lionel Ritchie, and others. Since its release in December 1999, Can I Change My Mind has received critical acclaim from publications throughout the world: A sure-fire winner! (Ray Ellis, Juke Blues) ...will please all fans of modern soul and soul blues (Peter R. Aschoff, Living Blues) ...the most imaginative and entertaining record in Billy Price's 30-year musical career (Pittsburgh Post-Gazette) Price's expressive abilities define the term \"deep soul\" (Pittsburgh City Paper. Billy Price released a double CD, Sworn Testimony: The Billy Price Band Live, in July 2002. \n\nIn July 2003, the Billy Price Band gave a critically acclaimed performance at the Belgium Rhythm & Blues Festival in Billy Price's first-ever appearance in Europe. A DVD of the concert, entitled Funky...Funky Soul!!! was released in late 2003. In addition to performing in venues in Pittsburgh, the eastern United States, and occasionally in Europe, Billy works full-time in corporate communications at the Software Engineering Institute at Carnegie Mellon University.\n\n \n <a href=\"https://www.last.fm/music/Billy+Price\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}