{"artist":{"name":"Hound Dog Taylor","mbid":"3a798d75-8ae4-4198-bda3-3a9728a646f3","url":"https://www.last.fm/music/+noredirect/Hound+Dog+Taylor","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b55351aa2332496fa5449e00a5faac82.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b55351aa2332496fa5449e00a5faac82.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b55351aa2332496fa5449e00a5faac82.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b55351aa2332496fa5449e00a5faac82.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b55351aa2332496fa5449e00a5faac82.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b55351aa2332496fa5449e00a5faac82.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"0","playcount":"0"},"similar":{"artist":[]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"60s","url":"https://www.last.fm/tag/60s"},{"name":"guitar","url":"https://www.last.fm/tag/guitar"},{"name":"slide guitar","url":"https://www.last.fm/tag/slide+guitar"},{"name":"Chicago Blues","url":"https://www.last.fm/tag/Chicago+Blues"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/Hound+Dog+Taylor/+wiki"}},"published":"07 May 2009, 02:20","summary":"Twelve fingered rough and ready blues maestro.\n\nTheodore Roosevelt \"Hound Dog\" Taylor (April 12, 1915 - December 17, 1975) was an American Chicago blues guitarist and singer.\n\nCareer\n\nTaylor was born in Natchez, Mississippi in 1915 (although some sources say 1917). He originally played piano, but began playing guitar when he was 20. He moved to Chicago in 1942.\n\nHe became a full-time musician around 1957 but remained unknown outside of the Chicago <a href=\"https://www.last.fm/music/+noredirect/Hound+Dog+Taylor\">Read more on Last.fm</a>","content":"Twelve fingered rough and ready blues maestro.\n\nTheodore Roosevelt \"Hound Dog\" Taylor (April 12, 1915 - December 17, 1975) was an American Chicago blues guitarist and singer.\n\nCareer\n\nTaylor was born in Natchez, Mississippi in 1915 (although some sources say 1917). He originally played piano, but began playing guitar when he was 20. He moved to Chicago in 1942.\n\nHe became a full-time musician around 1957 but remained unknown outside of the Chicago area where he played small clubs in the black neighborhoods and also at the open-air Maxwell Street Market. He was known for his electrified slide guitar playing roughly styled after that of Elmore James, his cheap Japanese Teisco guitars, and his raucous boogie beats. He was also famed among guitar players for having six fingers on his left hand.\n\nAfter hearing Taylor with his band, the HouseRockers (Brewer Phillips on second guitar and Ted Harvey on drums) in 1970 at Florence's Lounge on Chicago's South Side, Bruce Iglauer - at the time a shipping clerk for Delmark Records - tried to get him signed by his employer. Having no success getting Delmark to sign Taylor, Iglauer formed a small record label with a $2500 inheritance and recorded Taylor's debut album, Hound Dog Taylor and the HouseRockers, on his fledgling Alligator Records in 1971. It was the first release on Alligator, now a major blues label. It was recorded in a studio in just two nights. Iglauer began managing and booking the band, which toured nationwide and performed with Muddy Waters and Big Mama Thornton.[citation needed] The band became particularly popular in the Boston area, where Taylor inspired a young protégé named George Thorogood. A live album Live At Joe's Place documented a Boston appearance from 1972.\n\nTheir second release, Natural Boogie, was recorded in late 1973, and led to greater acclaim and touring. In 1975, Taylor and his band toured Australia and New Zealand with Freddie King and Sonny Terry and Brownie McGhee. His third Alligator album, Beware of the Dog, was recorded live in 1974 but was only released after his death. More posthumous releases occurred as well, including Genuine Houserocking Music and Release the Hound, on the Alligator label as well as some bootleg live recordings.\n\nTaylor died of lung cancer in 1975, and was buried in Restvale Cemetery in Alsip, Illinois.\n\nTaylor was posthumously inducted into the Blues Hall of Fame in 1984.[citation needed]\nDiscography\n\nHound Dog Taylor and The HouseRockers (1971)(Alligator Records)\n\nNatural Boogie (1974)(Alligator Records)\n\nBeware The Dog! (1976)(Alligator Records)\n\nGenuine Houserocking Music (1982)(Alligator Records)\n\nHound Dog Taylor - Deluxe Edition (1999)(Alligator Records)\n\nRelease The Hound (2004)(Alligator Records)\nLegacy\n\nGeorge Thorogood dedicated \"The Sky Is Crying\" (song 9) to \"the memory of the late great Hound Dog Taylor\" on his Live album (EMI America CDP 7 46329 2). <a href=\"https://www.last.fm/music/+noredirect/Hound+Dog+Taylor\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}