{"artist":{"name":"Les Paul","mbid":"f671ebd2-917d-466f-b7bc-07c60e4d8990","url":"https://www.last.fm/music/Les+Paul","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7c83ffa64d3945429af2386808e213e9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7c83ffa64d3945429af2386808e213e9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7c83ffa64d3945429af2386808e213e9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c83ffa64d3945429af2386808e213e9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c83ffa64d3945429af2386808e213e9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c83ffa64d3945429af2386808e213e9.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"76805","playcount":"416939"},"similar":{"artist":[{"name":"Les Paul & Mary Ford","url":"https://www.last.fm/music/Les+Paul+&+Mary+Ford","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/56201c005d3d46f0a479a99c7e8d998f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/56201c005d3d46f0a479a99c7e8d998f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/56201c005d3d46f0a479a99c7e8d998f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56201c005d3d46f0a479a99c7e8d998f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56201c005d3d46f0a479a99c7e8d998f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56201c005d3d46f0a479a99c7e8d998f.png","size":""}]},{"name":"Chet Atkins","url":"https://www.last.fm/music/Chet+Atkins","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c4d5ef3956f0494db4b867dfc9135a39.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c4d5ef3956f0494db4b867dfc9135a39.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c4d5ef3956f0494db4b867dfc9135a39.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4d5ef3956f0494db4b867dfc9135a39.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4d5ef3956f0494db4b867dfc9135a39.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4d5ef3956f0494db4b867dfc9135a39.png","size":""}]},{"name":"Fats Waller","url":"https://www.last.fm/music/Fats+Waller","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5017bce7cde349bc987f715e716bcafa.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5017bce7cde349bc987f715e716bcafa.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5017bce7cde349bc987f715e716bcafa.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5017bce7cde349bc987f715e716bcafa.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5017bce7cde349bc987f715e716bcafa.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5017bce7cde349bc987f715e716bcafa.png","size":""}]},{"name":"Eddie Fisher","url":"https://www.last.fm/music/Eddie+Fisher","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2e320afb7ce7499e8b2d72114ef9c124.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2e320afb7ce7499e8b2d72114ef9c124.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2e320afb7ce7499e8b2d72114ef9c124.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2e320afb7ce7499e8b2d72114ef9c124.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2e320afb7ce7499e8b2d72114ef9c124.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2e320afb7ce7499e8b2d72114ef9c124.png","size":""}]},{"name":"Johnny Winter","url":"https://www.last.fm/music/Johnny+Winter","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/546768ae6a8c491dadb3a9dd8350a5e4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/546768ae6a8c491dadb3a9dd8350a5e4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/546768ae6a8c491dadb3a9dd8350a5e4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/546768ae6a8c491dadb3a9dd8350a5e4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/546768ae6a8c491dadb3a9dd8350a5e4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/546768ae6a8c491dadb3a9dd8350a5e4.png","size":""}]}]},"tags":{"tag":[{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"guitar","url":"https://www.last.fm/tag/guitar"},{"name":"classic rock","url":"https://www.last.fm/tag/classic+rock"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Les+Paul/+wiki"}},"published":"22 Jul 2006, 04:24","summary":"Les Paul (born June 9, 1915 - August 13, 2009) was best known as a skilled guitarist, and as one of the most important figures in the development of modern electric instruments and recording techniques. He was a pioneer in the development of the solid-body electric guitar (the Gibson Les Paul, which he helped design, is one of the most famous and enduring models), multitrack recording, and various reverb and echo effects.\n\nBiography\nPaul, born Lester William Polsfuss (the last name simplified later by his mother to Polfus) in Waukesha <a href=\"https://www.last.fm/music/Les+Paul\">Read more on Last.fm</a>","content":"Les Paul (born June 9, 1915 - August 13, 2009) was best known as a skilled guitarist, and as one of the most important figures in the development of modern electric instruments and recording techniques. He was a pioneer in the development of the solid-body electric guitar (the Gibson Les Paul, which he helped design, is one of the most famous and enduring models), multitrack recording, and various reverb and echo effects.\n\nBiography\nPaul, born Lester William Polsfuss (the last name simplified later by his mother to Polfus) in Waukesha, Wisconsin, first became interested in music at the age of eight, when he began playing the harmonica. After an attempt at learning to play the banjo, Paul began to play the guitar. By 13, Paul was performing semi-professionally as a country-music guitarist. At the age of 17, Paul played with Rube Tronson's Cowboys. Soon after, he dropped out of high school to join Wolverton's Radio Band in St. Louis, Missouri on KMOX.\n\nIn the 1930s, Paul worked in Chicago, Illinois in radio, where he performed jazz music. Paul's first two records were released in 1936. One album was credited to Rhubarb Red, Paul's hillbilly alter ego, and the other was in the backing band for blues artist Georgia White.\n \nLes Paul's 'The Log', one of the first solidbody electric guitars.Paul was unsatisfied by the electric guitars that were sold in the mid 1930s and began experimenting with a few designs of his own. Famously, he created The Log which was nothing more than a length of common \"4 by 4\" fence post with bridge, guitar neck, and pickup attached. For appearances he attached the body of an Epiphone jazz guitar, sawn lengthwise with The Log in the middle. This solved his two main problems - feedback, as the acoustic body no longer resonated with the amplified sound, and sustain, as the energy of the strings was not dissipated in generating sound through the guitar body.\n\nIn 1938, Paul moved to New York and landed a featured spot with Fred Waring's Pennsylvanians radio show. Paul moved to Hollywood in 1943, where he formed a new trio. As a last-minute replacement for Oscar Moore, Paul played with Nat King Cole and other artists in the inaugural Jazz at the Philharmonic concert in Los Angeles on July 2, 1944. Also that year, Paul's trio appeared on Bing Crosby's radio show. Crosby went on to sponsor Paul's recording experiments. The two also recorded together several times, including a 1945 number one hit, \"It's Been a Long, Long Time.\" In addition to backing Crosby and artists like the Andrews Sisters, Paul's trio also recorded a few albums of their own in the late 1940s.\n\nIn 1941, Paul designed and built one of the first solid-body electric guitars (though Leo Fender also independently invented his own solid-body electric guitar around the same time, and Adolph Rickenbacker had marketed a solid-body guitar in the 30s). Gibson Guitar Corporation designed a guitar incorporating Paul's suggestions in the early fifties, and presented it to him to try. He was impressed enough to sign a contract for what became the \"Les Paul\" model (originally only in a \"gold top\" version), and agreed never to be seen playing in public, or photographed with, anything other than a Gibson guitar. That persisted until 1961, when Gibson changed the design without Paul's knowledge. He said he first saw the \"new\" Gibson Les Paul in a music store window, and disliked it. Though contract required him to pose with the guitar, he said it was not \"his\" instrument, and asked Gibson to remove his name from the headstock. Gibson renamed the guitar the \" SG\", and it also became one of the company's best sellers. Later, Paul resumed his relationship with Gibson, and endorses the instrument even today (though his personal Gibson Les Pauls are much modified by him - Paul always uses his own self-wound pickups on his guitars). To this day, the Gibson Les Paul guitar is used all over the world, both by novice and professional guitarists.\n\nIn 1947, Capitol Records released a recording that had begun as an experiment in Paul's garage, entitled \"Lover (When You're Near Me)\", which featured Paul playing eight different parts on electric guitar, some of them recorded at half-speed, hence \"double-fast\" when played back at normal speed for the master. This was the first time that multi-tracking had been used in a recording. Amazingly, these recordings were made, not with magnetic tape, but with wax disks. Paul would record a track onto a disk, then record himself playing another part with the first. He built the multi-track recording with overlaid tracks, rather than parallel ones as he did later. There is no record of how few 'takes' were needed before he was satisfied with one layer and moved onto the next.\n\nPaul even built his own wax-cutter assembly, based on auto parts. He favored the flywheel from a Cadillac for its weight and flatness. Even in these early days, he used the wax disk setup to record parts at different speeds and with delay, resulting in his signature sound with echoes and birdsong-like guitar riffs. When he later began using magnetic tape, the major change was that he could take his recording rig on tour with him, even making episodes for his 15-minute radio show in his hotel room.\n\nPaul was injured in a near-fatal automobile accident in January 1948 in Oklahoma, which shattered his right arm and elbow. Paul spent a year and a half recovering. Paul instructed the surgeons to set his arm at an angle that would allow him to cradle and pick the guitar.\n\nIn the early 1950s, Paul made a number of revolutionary recordings with wife, Mary Ford. These records were unique for their heavy use of overdubbing, which was technically impossible before Paul's invention of multitrack recording. Paul's multitracking system was made possible by the introduction of reel-to-reel audio tape recording, developed by Jack Mullin and the Ampex company in the late 1940s, with the backing of radio, film and recording star Bing Crosby.\n\nCrosby gave Les Paul what was only the second of the now-famous Ampex Model 200 recorder, which was the world's first commercially-produced reel-to-reel tape recorder. Using this machine, Paul developed his tape multitrack system by adding an additional recording head and extra circuitry, allowing multiple tracks to be recorded separately and asynchronously on the same tape. Paul's invention was quickly developed by Ampex into commercially-produced two-track and three-track recorders, and these machines were the backbone of the professional recording studio, radio and TV industry in the 1950s and early 1960s.\n\nIn 1954 Paul, continued to develop this technology, by commissioning Ampex to build the first eight track tape recorder, at his expense. His idea, later known as \"Sel-Sync,\" in which a specially-modified recording head could simultaneously record a new track and play back previously recorded ones, was the core technology for multi-track recording for the next thirty years.\n\nDuring his early radio shows, Paul introduced the mythical \"Les Paulverizer\" device, which was supposed to multiply anything fed into it, like a guitar sound or a voice. This even became the subject of comedy, with Mary Ford multiplying herself and her vacuum cleaner with it so she could finish the housework faster (a typical joke in the pre-feminist era). Later Paul made the myth real for his stage show, using hidden equipment which over the years has become smaller and more visible. Currently he uses a small box attached to his guitar - it is not known how much of the device remains off-stage. He typically lays down one track after another on stage, in-sync, and then plays over the repeating forms he has recorded. With newer digital sound technology, such an effect is available commercially.\n\nIn the late 1960s, Paul went into semi-retirement, although he did return to the studio occasionally. He recorded an album Lester and Chester with Chet Atkins. He and Mary Ford (born Iris Colleen Summers) divorced amicably in December 1964, as she could no longer tolerate the itinerant lifestyle their act required of them.\n\nIn 1978, Les Paul and Mary Ford were inducted into the Grammy Hall of Fame. He received a Grammy Trustees Award for his lifetime achievements in 1983. In 1988, Paul was inducted into the Rock and Roll Hall of Fame by Jeff Beck, who said, \"I've copied more licks from Les Paul than I'd like to admit.\" Les Paul was inducted into the National Inventors Hall of Fame in May 2005 for his development of the solid-body electric guitar.\n\nAs of 2006, At the age of 90, Les Paul won two Grammys at the 48th Annual Grammy Awards for his album Les Paul & Friends: American Made World Played. He also performs weekly at the Iridium Jazz Club on Broadway in New York City, despite the arthritis that has stilled all but two of the fingers on his left hand.\n\nSource: From Wikipedia, the free encyclopedia\nhttp://en.wikipedia.org/wiki/Les_Paul\n <a href=\"https://www.last.fm/music/Les+Paul\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}