{"artist":{"name":"Orion","mbid":"dee4b67c-45f3-4391-bacf-4df8d6691c1a","url":"https://www.last.fm/music/Orion","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8f829e77e219dbbd13e626ab1a17512e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8f829e77e219dbbd13e626ab1a17512e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8f829e77e219dbbd13e626ab1a17512e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8f829e77e219dbbd13e626ab1a17512e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8f829e77e219dbbd13e626ab1a17512e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8f829e77e219dbbd13e626ab1a17512e.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"64647","playcount":"439171"},"similar":{"artist":[{"name":"MFG","url":"https://www.last.fm/music/MFG","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7069baa2a72dbc1d20889751b04c10ce.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7069baa2a72dbc1d20889751b04c10ce.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7069baa2a72dbc1d20889751b04c10ce.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7069baa2a72dbc1d20889751b04c10ce.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7069baa2a72dbc1d20889751b04c10ce.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7069baa2a72dbc1d20889751b04c10ce.png","size":""}]},{"name":"Modern Day Babylon","url":"https://www.last.fm/music/Modern+Day+Babylon","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/22df02e4297f4d0fb5454cd3acbc8de2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/22df02e4297f4d0fb5454cd3acbc8de2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/22df02e4297f4d0fb5454cd3acbc8de2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/22df02e4297f4d0fb5454cd3acbc8de2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/22df02e4297f4d0fb5454cd3acbc8de2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/22df02e4297f4d0fb5454cd3acbc8de2.png","size":""}]},{"name":"Jakub Żytecki","url":"https://www.last.fm/music/Jakub+%C5%BBytecki","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4949101b96f6462586e4ec95af6e5169.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4949101b96f6462586e4ec95af6e5169.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4949101b96f6462586e4ec95af6e5169.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4949101b96f6462586e4ec95af6e5169.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4949101b96f6462586e4ec95af6e5169.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4949101b96f6462586e4ec95af6e5169.png","size":""}]},{"name":"Space Tribe","url":"https://www.last.fm/music/Space+Tribe","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ebbdd3fe6679456f9fc9d411612de053.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ebbdd3fe6679456f9fc9d411612de053.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ebbdd3fe6679456f9fc9d411612de053.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ebbdd3fe6679456f9fc9d411612de053.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ebbdd3fe6679456f9fc9d411612de053.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ebbdd3fe6679456f9fc9d411612de053.png","size":""}]},{"name":"Anup Sastry","url":"https://www.last.fm/music/Anup+Sastry","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/44d623565f4648c8c89f15b7140b27c8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/44d623565f4648c8c89f15b7140b27c8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/44d623565f4648c8c89f15b7140b27c8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44d623565f4648c8c89f15b7140b27c8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44d623565f4648c8c89f15b7140b27c8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44d623565f4648c8c89f15b7140b27c8.png","size":""}]}]},"tags":{"tag":[{"name":"psytrance","url":"https://www.last.fm/tag/psytrance"},{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"goa","url":"https://www.last.fm/tag/goa"},{"name":"psychedelic trance","url":"https://www.last.fm/tag/psychedelic+trance"},{"name":"DJENT","url":"https://www.last.fm/tag/DJENT"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Orion/+wiki"}},"published":"25 Jun 2006, 10:18","summary":"There are 31 people/groups known as Orion:\n\n1) Orion - Michal Opletal, Czech hip-hop artist and producer (also known as Papa Ori, Vorel or Mitch Bjukenen), member of PSH.\n2) A psychedelic trance project by Danish producer & DJ Jean Borelli. \n3) A Moldavian singer and producer.\n4) Jimmy Ellis aka Orion was an American solo artist.\n5) An Estonian pop/rock band.\n6) Alias for Ørjan Nilsen aka DJ Governor.\n7) A Finnish DJ/Producer\n8) A rapper from Germany, Sachsen-Anhalt. <a href=\"https://www.last.fm/music/Orion\">Read more on Last.fm</a>","content":"There are 31 people/groups known as Orion:\n\n1) Orion - Michal Opletal, Czech hip-hop artist and producer (also known as Papa Ori, Vorel or Mitch Bjukenen), member of PSH.\n2) A psychedelic trance project by Danish producer & DJ Jean Borelli. \n3) A Moldavian singer and producer.\n4) Jimmy Ellis aka Orion was an American solo artist.\n5) An Estonian pop/rock band.\n6) Alias for Ørjan Nilsen aka DJ Governor.\n7) A Finnish DJ/Producer\n8) A rapper from Germany, Sachsen-Anhalt.\n9) A Turkish rock band founded in 2003.\n10) A Celtic folk band from Belgium.\n11) A crack/demo group.\n12) A black metal project featuring members of UK underground bands such as Artisian and Korvus\n13) A band from Oneşti, Romania. \n14) A space rock Group from Lawrence, KS.\n15) An UK based 'laid-back funky trio' featuring Ken Freeman\n16) A Pakistani metal band\n17) Tomasz Wróblewski, stage name Orion, is a Polish black metal musician, current vocalist of Vesania and bassist of Behemoth.\n18) A Dutch rockband, and later studio project featuring Niek Lucassen\n19) Orion is Macedonian metal band, which was active in the early 1990's.\n20) ORION were a Middlesex-based NWOBHM band who released one 7\", 'Insane In Another World', in 1984.\n21) Orion is a Frisian Gothic Metal band from the Netherlands.\n22) Orion was a French progressive rock band.\n23) Orion, South Florida based Hip Hop artist. www.orionhiphop.com\n24) Orion, a Croatian rock band from Split\n25) Orion, a band comprised of RyanAdams and Jamie Candiloro\n26) A rapper from Lithuania\n27) Orion IS A MAN From USA which channel www.soundcloud.com/orion currently producing.\n28) Orion is a progressive metal outfit from Mumbai, India.\n29) Orion is a progressive metal band from Manchester, UK.\n30) Orion is a post-punk band from Sydney, Australia.\n31) Orion is a drum and bass producer from Illinois, USA.\n\n1)\nOrion (born in 1976, Praha), real name Michal Opletal (aka Papa Vorel aka Miki aka Orion aka Ori aka Mitch Bjukenen atd.). In 1993 year he created hip-hop squad Peneři strýčka Homeboye. From beginning of his career he rejects dealing with major labels, mentioning loss of indentity. He appeared on almost every important czech hip hop album and has a status of father of the local scene. In 2006 year he received gold Anděl (czech Grammy)yfor the best hip-hop & r'n'b album for disc \"Teritorium II\"(one of his solo albums). 2006 PSH published new album called Rap'n'Roll. He is recording an album with James Cole from Supercrooo.\n\n\n2)\nOrion is an electronic music project by Danish producer & DJ Jean Borelli. The project was started in 1995, and has since then released 5 albums and a wide variety of singles and compilation material. Jean Borelli has also been creating electronic dancemusic with various artists in the goa/psychedelic trance scene.The main aim of Orion is trying to combine various trance styles in one singular blend, which is the trademark of his sound.\n\n\n3)\nOrion is Moldavian singer and producer. He wanted to sing in the Moldavian Eurovision preselections 2006, but his song \"Kiss Me\" didn't qualify. This year he got in first round of preselections with song called \"Desperado\"; but did not make it to the final. His songs have a similar style to O-zone.\n\n\n4)\nJimmy Ellis aka Orion, was born in 1945 in Orville, Alabama. His natural voice was very similar to the voice of Elvis Presley, and he used his voice in a masked stage character called Orion, taken from a novel of Gail Brewer-Giorgio based on a famous singer who fakes his own death. \n\nJimmy Ellis began recording in 1964 for the Dradco label. In 1972 recorded for Sun Records two Elvis's songs: That's All Right Mama and Blue Moon of Kentucky.\n\nIn 1979 Ellis recorded many old Jerry Lee Lewis's songs overdubbing the Jerry's voice: Sweet Little Sixteen, Save the Last Dance for Me, Cold Cold Heart, Good Golly Miss Molly and many others. The album was credited as Jerry Lee Lewis and Friend and get the top 20, causing a great speculation about the identity of that mysterious \"friend\" who sounds exactly like Elvis. A TV show made a scientific scan and concluded that only could be the voice of Elvis.\nThat year Jimmy Ellis starts his career as Orion recording songs as Ebony Eyes, a version of Matchbox's Rockabilly Rebeland Queen's This Little Thing Called Love.\n\nIn 1983 he decides to take off the mask and tries to start a serious musical career trying not to sound like Elvis, but that wasn't easy, so finally he retorned the mask in 1987.\n\nOn the night of Dec. 12, 1998, Jimmy Ellis and his wife Elaine were killed in a robbery attempt to his convenience store by three local teens armed with shotguns.\n\n\n5)\nOrion is an Estonian pop/rock band.\nhttp://orion.pri.ee/\n\n\n6)\nOrion is an alias for Ørjan Nilsen aka DJ Governor.\n\n\n7)\nOrion is a Finnish DJ/Producer\nwww.iki.fi/juska\n\n\n8)\nOrion is a rapper from Sachsen-Anhalt, Germany.\nHis rap-partner is VIper.\n\n\n9)\nOrion is a Turkish rock band. The band formed in February 2003 by Yildirim Erdemli. Orion is writing their own songs and playing Turkish rock. All band members are influenced by different musicians so that is effecting their compositions and performances by making them very different from one to another.\nwww.gruporion.com\n\n\n10)\nOrion is a Celtic folk band from Belgium\nhttp://www.orionceltic.com/\n\n\n11)\nORiON - a crack/demogroup.\n\n\n12)\nOrion - A black metal project featuring members of UK underground bands such as Artisian and Korvus\n\n\n13)\nOrion was a band from Oneşti, Romania. Some members also played in Godless and Offroad.\n\n\n14)\nOrion - space rock Group from Lawrence, KS. Previous members played in Tablets of Orion and Reggie and the Full Effect.\n\n\n15)\nOrion- UK based 'laid-back funky trio' featuring Ken Freeman who \"incorporate a range of diverse styles from just about everywhere, jazz, [taglatin[/tag], blues, funk, even reggae.\" www.orionmusic.co.uk\n\n\n16)\nOrion is a Pakistani thrash metal band formed in 2006. they heve released 1 demo, 1 full-lenght album and 1 split album with odyssey (pak).\nThe band was formed by Hussam Raza (guitar) and Bilal Nadeem (drums). Ameer Hamza joined when Bilal joined another school and became friends with him. Waqas was never formally asked to join the band, but just joined the band when he saw Orion jamming in their basement. Imaad and Hammad were asked to join the band for the Angel of Dust album.\nThe band went on hold soon after the release of Angel of Dust and from its ashes Odyssey (Pak) was formed.\n\n\n\n17)\nTomasz Wróblewski, stage name Orion, is a Polish heavy metal musician, current bassist of Behemoth and vocalist/guitarist of Vesania. He also plays bass in a Polish rock band called \"Black River\".\n\n18)\nOrion is a Dutch band featuring Niek Lucassen. First started out as a band, but over time they gradually evolved into a studio project.  Orion was active from 2002-2006 and released their debut album 'Fake Plastic Love' in the fall of 2005 \n\n21)\nOrion is a Frisian Gothic Metal band from the Netherlands, who only brought out one demo album, which includes the following tracks:\n*      De fjouwer geheimen (9:36)\n*      It riedsel fan de dream (6:24)\n\n22) Orion was a French progressive rock band which release a sole album in 1979 entitled \"La Nature vit, l'Homme lui, critique...\". The band was composed of - Franck Mamosa / guitar, Janusz Tokarz / keyboards and Laurent Delenne / flute, vocals.\nTheir LP was re-issued on cd thanks to Musea.\n\n\n25)\nOrion 2010 is a band comprised of D.R.A. (David Ryan Adams) and Jamie Candiloro (candyman.) Their freshman album was released in 2010 however recorded in 2006. Orion their first album was released on vinyl and digital download only. Orion would go under the genre of \"Legit Metal.\"\n\n28)\nOrion is a Progressive Death Metal outfit from Mumbai, India formed in 2008. The band consists of Vigneshkumar Venkatraman (Vocals/Guitars), Ashwin Kulkarni (Guitars), Anshuman Bhattacharya (Bass) and Ptritesh Prabhune (Drums). The band released an EP, \"On The Banks Of Rubicon\" in the year 2012. \n\n29)\nOrion is a Progressive Metal band from Manchester, UK, originally formed in 2010. The band currently consists of Ryan Robb (guitars), Alex Huzar (guitars), Phil Owen (vocals), Nathan McLeish (drums) and Alex Sharpe (bass). They have released one EP (Where Whales Go To Die (2011)) and two albums (All This World Means (2012) and Yugen (2014)).\n\n30)\nTwo parts Oily Boys, two parts Whores. Danceable post-punk from Sydney.\n\n31)\nJohn O'Brien under the alias Orion (or DJ Orion) was a drum and bass producer from Chicago, Illinois, USA. O'Brien passed away in 2011 at the age of 45. <a href=\"https://www.last.fm/music/Orion\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}