{"artist":{"name":"The Administration","url":"https://www.last.fm/music/+noredirect/The+Administration","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"0","playcount":"0"},"similar":{"artist":[]},"tags":{"tag":[{"name":"Ottawa","url":"https://www.last.fm/tag/Ottawa"},{"name":"punkottawa","url":"https://www.last.fm/tag/punkottawa"},{"name":"nu-bluz","url":"https://www.last.fm/tag/nu-bluz"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/The+Administration/+wiki"}},"published":"18 Feb 2007, 18:27","summary":"The Administration formed in May 2005 as the lo-fi project of Brad Baker and Joe Simek, after these two musicians transplanted from Chicago to the northern suburbs of Philadelphia. The Administration spent the next year crafting a sound that mixed drum machine beats with melodic piano and crunchy guitar. After playing a handful of shows in the Philadelphia area, the duo released their debut LP, Inaugural, in 2006 on startup label Pace of Change Records and hit the road to play a successful homecoming show in Chicago. <a href=\"https://www.last.fm/music/+noredirect/The+Administration\">Read more on Last.fm</a>","content":"The Administration formed in May 2005 as the lo-fi project of Brad Baker and Joe Simek, after these two musicians transplanted from Chicago to the northern suburbs of Philadelphia. The Administration spent the next year crafting a sound that mixed drum machine beats with melodic piano and crunchy guitar. After playing a handful of shows in the Philadelphia area, the duo released their debut LP, Inaugural, in 2006 on startup label Pace of Change Records and hit the road to play a successful homecoming show in Chicago.\n\nThe Administration continued to make inroads into the Philadelphia music scene, playing with local and national bands like East Hundred, Witness, The Black Atlantic, Mr. Gnome, Aderbat and Brian Bonz. The band was also busy expanding its sound by incorporating laptop production and turntables with the help of friend DJ eLove. After eLove’s departure a few months later, the band brought in drummer and electronic musician Chris Caulder to shape a collection of songs that would be released as The Borough EP in 2007. The EP mixed the many elements of the band’s previous efforts: hook-laden pop, socially-conscious lyrics, electronic beats, and a powerful rock sound.\n\nNearly a year later, The Administration has resurfaced. This time it’s back to the original songwriting team of Simek and Baker. The duo is currently crafting the next twist in The Administration’s sound: more recordings of rock and revolution. Stay tuned. <a href=\"https://www.last.fm/music/+noredirect/The+Administration\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}