{"artist":{"name":"T","mbid":"d2faa4dd-f3fc-4aa9-aa9e-001826d6fdd2","url":"https://www.last.fm/music/T","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e0bbb13a67028ceb65d9f31a54ad63a4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e0bbb13a67028ceb65d9f31a54ad63a4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e0bbb13a67028ceb65d9f31a54ad63a4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0bbb13a67028ceb65d9f31a54ad63a4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0bbb13a67028ceb65d9f31a54ad63a4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0bbb13a67028ceb65d9f31a54ad63a4.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"35851","playcount":"248949"},"similar":{"artist":[{"name":"Dave Kerzner","url":"https://www.last.fm/music/Dave+Kerzner","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f747b381102941e9c15c31efceb15bd8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f747b381102941e9c15c31efceb15bd8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f747b381102941e9c15c31efceb15bd8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f747b381102941e9c15c31efceb15bd8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f747b381102941e9c15c31efceb15bd8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f747b381102941e9c15c31efceb15bd8.png","size":""}]},{"name":"The Tangent","url":"https://www.last.fm/music/The+Tangent","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/519fc2c847594e2b8a88bbda3d027037.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/519fc2c847594e2b8a88bbda3d027037.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/519fc2c847594e2b8a88bbda3d027037.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/519fc2c847594e2b8a88bbda3d027037.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/519fc2c847594e2b8a88bbda3d027037.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/519fc2c847594e2b8a88bbda3d027037.png","size":""}]},{"name":"Anubis","url":"https://www.last.fm/music/Anubis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cccc38a2d7be4150c17c2b8f85f2c976.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cccc38a2d7be4150c17c2b8f85f2c976.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cccc38a2d7be4150c17c2b8f85f2c976.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cccc38a2d7be4150c17c2b8f85f2c976.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cccc38a2d7be4150c17c2b8f85f2c976.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cccc38a2d7be4150c17c2b8f85f2c976.png","size":""}]},{"name":"Sky Architect","url":"https://www.last.fm/music/Sky+Architect","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0059caa200bd4c8399584b640a59873e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0059caa200bd4c8399584b640a59873e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0059caa200bd4c8399584b640a59873e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0059caa200bd4c8399584b640a59873e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0059caa200bd4c8399584b640a59873e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0059caa200bd4c8399584b640a59873e.png","size":""}]},{"name":"Comedy of Errors","url":"https://www.last.fm/music/Comedy+of+Errors","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7abdd38a5001486dc884301f5023a145.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7abdd38a5001486dc884301f5023a145.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7abdd38a5001486dc884301f5023a145.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7abdd38a5001486dc884301f5023a145.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7abdd38a5001486dc884301f5023a145.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7abdd38a5001486dc884301f5023a145.png","size":""}]}]},"tags":{"tag":[{"name":"Progressive rock","url":"https://www.last.fm/tag/Progressive+rock"},{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"Korean","url":"https://www.last.fm/tag/Korean"},{"name":"german","url":"https://www.last.fm/tag/german"},{"name":"Kpop","url":"https://www.last.fm/tag/Kpop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/T/+wiki"}},"published":"19 Apr 2007, 17:43","summary":"There are five artists going by the name \"T\":\n\n1. T is a performance name of Thomas Thielen, a german progressive rock musician. Thomas Thielen (AKA “t”) was born and is based in Germay. Initially a keyboard player, he soon jumped to bass and eventually guitar after he joined his first band in his teens. He was a member of a German band called Scythe in the ’90s, and when it disbanded he eventually began doing solo albums and adopted the “t” moniker. <a href=\"https://www.last.fm/music/T\">Read more on Last.fm</a>","content":"There are five artists going by the name \"T\":\n\n1. T is a performance name of Thomas Thielen, a german progressive rock musician. Thomas Thielen (AKA “t”) was born and is based in Germay. Initially a keyboard player, he soon jumped to bass and eventually guitar after he joined his first band in his teens. He was a member of a German band called Scythe in the ’90s, and when it disbanded he eventually began doing solo albums and adopted the “t” moniker. In his leisure time, t works as a teacher (latin / english) and a teacher for teachers (educational psychology). He is also a father (to Sophia, born 2010), a husband (married to the famous photographer and writer Katia Tangian), a dedicated, yet mediocre football player, and an aficionado of literature and cinema.\n\nDiscography: (regular albums);\n    t - Naive (2001)\n    t - Voices (2006)\n    t - Anti-Matter Poetry (2010)\n    t - Psychoanorexia (2013)\n    t - Fragmentropy (2015)\n    t - Epistrophobia (2016)\n\nT has always been making music. he has always been writing music, as well. given the opportunity to learn to play the piano from earliest childhood on, he decided to learn the guitar as well at the age of 12. because of the girls, of course. when a few friends of his, long-time guitar hero lothar hilgers (14), newly-designed singer peter niederpruem (15), bass-player-to-be stefan hilgers (14) and drummer stefan wagner (15) decided to line up as a band, t joined as keyboarder and rhythm guitarist. however, due to musical differences this line-up of \"The Rubbish\" was - though critically acclaimed as hell (by almost all the girls of the 9a AND 9b!) - only short-lived. that is nicer than saying it right: t was opted out because of his tendency to be too, quote, \"productive, creative and constructive\" at rehearsals. he sure was a pain in the ass, back then.\nat the age of 14 he decided to enter his first real band \"backyard\", formed by frederik schlenk, marius boeffgen and yours truely. to get in, he simply lied and said that he, of course, was a bass player as well. though the other boys were 18 already at that time, they decided to invite him for some rehearsals, because in the eifel there were no bass players whatsoever at that time that met their needs. t managed to get his mother to get him a bass guitar until the next day (which he still fondly plays, an aria 4string with great cure-like power), and then got the job, not least because of a lack of alternatives.\n \nbackyard, as a bluesrock band, taught him a lot about gigs, the feeling of music and dynamics, improvisation and, as simple as it may sound, listening. but the sound structure and musical simplicity of the material they played (mostly albeit idiosyncratic cover versions of classics like cocaine or white room or red house...) were not after his tastes.\n \nso, in 1992, at the age of 16, he started looking for musicians who shared his vision of something he didn't then know was called artrock: powds con fusion, a first version of the later prog heroes scythe, came into being, featuring udo gerhards on keyboards, marius boeffgen on drums, stephan kloep on keyboards and saxophone, alexandra simon on flute, t on guitars and vocals, uli michels and later udo hargarten on bass (and quite often on vocals, the mists of time vary in their whispers). the musical world was, once more, saved, revolutionized, shirred, staken, got a new hairstyle - and answered these effort with loads of nothing but a frown, really.\n \nso powds con fusion was abandoned, or better: distilled into scythe featuring martin walter on drums, ingo roden on bass, udo gerhards on keyboards and t as guitar player and lead vocalist. scythe then got the interest of the crowds (which, when talking about artrock, means about 10-30 people) and subsequently a record deal with galileo records. one album was produced: divorced land (1999). produced is a big word for the process, really, as it was recorded in a primary school with very few microphones, mixed without one single compressor at hand and only one reverb to be used, and mastered in a rush by someone not very much interested (understandably, if you consider the quality of the final mixes). the sound quality is, let's say, worth a remix one day, all the more so as the album got good reviews and was said to display the talents of one of the next big prog bands of the world, century etc. however, scythe split up shortly afterwards for musical differences not so much as for private reasons: their jobs called the members simply to far apart to go on musicing together.\nt was then left alone with new material, and decided to go for the big egomania: a solo project. with a little luck he managed to persuade galileo records to put it out, and the result, naive, was subsequently, as they say, critically acclaimed. it took him 4 years to shake off the self-consciousness and pressure this put upon our little musician, but then voices followed, which was applauded even more, to the very confusion of the author.\n \nnow, when we talk about solo albums here, we *really* talk about doing everything practically alone. apart from some help in the mixing, t is control freak and artist in one go and extremely bad at delegating. so, it might not be too surprising to see that it took him 4 years again to get anti-matter poetry, his third solo album, out. having become better at sound engineering, t now mixed the whole thing by himself, as well. this is also true for the next piece of work, psychoanorexia (2012).\nfunnily enough, he is still being referred to as \"the ex-frontman of the german progband scythe\" and understands a bit better how frustrating it must have been for, say, fish for all these years.\n \nin his leisure time, t works as a teacher (latin / english) and a teacher for teachers (educational psychology) and is also a father (sophia, born 2010), a husband (married to the famous photographer and writer katia tangian, and still doesn't know why she doesn't realize her mistake), a dedicated, yet mediocre football player and quite a lot into literature and cinema.\n\n\n\n\n___________________________________________________________________________\n\n2. Tasha (T) Reid is a Korean-African American R&B singer and rapper born in Portland, Texas on May 31, 1981 to an African American father and a Korean mother. She was a core member of the Korean hip hop and R&B group Uptown, starting out when she was only 16 years old. She later formed Tashannie, a hip-hop and R&B duo in 1999 where she was the primary vocalist. In 2001, she started a solo career under the moniker T. Reid, who speaks Korean and English fluently, is one of the most influential rappers in Korea as well as the most influential female. After settling a dispute with her former record company, World Music, Reid's new album, Yoon Mi Rae (윤미래), was released in February 2007. The album title is T's Korean name.\n\n3. T is solo project by a French man, Thomas Walter, on the label Herzfeld. His first album is called \"b category film\" second one \"T\" released in 2005 is eponymous. Third lp \"Bau\" October 2007. T also plays the drums for the band Loyola. His music is a mix of acoustic tunes sometimes mixed with electronic beats. http://www.hrzfld.com/ \n\n4. The vocalist of hardcore punk band Product of Waste has also released hip hop tracks under the name T. \n\n5. /T is a Japanese electronic doujin music arranger. <a href=\"https://www.last.fm/music/T\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}